# https://github.com/Homebrew/homebrew-bundle
# In order to speed the initial bootstrap process, this Brewfile only installs
# essentials. A more complete Brewfile is symlinked to the home directory when
# the dotfiles are installed. After the initial bootstrap is complete, run
# `brew bundle install --global`

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "thoughtbot/formulae"

# Homebrew
# https://github.com/Homebrew/brew/
brew "bash-completion"
brew "ctags"
brew "dockutil"
brew "dos2unix"
brew "git"
brew "glib"
brew "homebrew/dupes/rsync"
brew "htop"
brew "imagemagick"
brew "jpeg"
brew "libevent"
brew "libffi"
brew "libpng"
brew "libssh2"
brew "libtiff"
brew "libtool"
brew "libyaml"
brew "openssl"
brew "pgcli"
brew "pkg-config"
brew "postgresql", service_restart: true
brew "python"
brew "rbenv"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis", service_restart: true
brew "ruby-build"
brew "sqlite"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "xz"
brew "zsh"